In [41]:
# 실습환경 설정
import numpy as np
import pandas as pd
from pandas import Series, DataFrame

2. 파이썬 기본문법

2.1 연산자

In [5]:
# 제곱연산자
print("2 ** 1 = ", 2**1)

2 ** 1 =  2

In [4]:
# 나눗셈
print("3 / 2 = ",3/2)

3 / 2 =  1.5

In [3]:
# 몫 연산자
print(" 3 // 2 = ",3//2)

 3 // 2 =  1

In [6]:
# 나머지
print(" 5 % 2 = ",5%2)

 5 % 2 =  1

In [53]:
# 복합대입연산자
a = 100
a += 50
print(a)
a *= 2
print(a)
a /= 3
print(a)

150
300
100.0

In [57]:
a = 100
a = a + 50
print(a)
a = a * 2
print(a)
a = a / 3
print(a)

150
300
100.0

In [56]:
hawling = "안녕하세요"
hawling += "요"
hawling += "요"
hawling *= 2
print(hawling)

안녕하세요요요안녕하세요요요

2.2 조건문

In [9]:
# if else
number=input("정수입력 > ")
number=int(number)
if number %2 == 0:
    print("짝수입니다.")
else:
    print("홀수입니다.")

정수입력 > 30
짝수입니다.

In [10]:
# if elif else
import datetime
now = datetime.datetime.now()
month=now.month
if 3<= month <= 5 :
    print( "현재는 봄 입니다.")
elif 6<= month <= 8 :
    print( "현재는 여름 입니다.")
elif 9<= month <= 11 :
    print( "현재는 가을 입니다.")
else:
    print( "현재는 겨울 입니다.")

현재는 가을 입니다.

2.3 반복문

In [11]:
for i in range(5):
    print(str(i) + "=반복변수")
print()

for i in range(5, 10):
    print(str(i) + "=반복변수")
print()

for i in range(0, 10, 3):
    print(str(i) + "=반복변수")
print()

0=반복변수
1=반복변수
2=반복변수
3=반복변수
4=반복변수

5=반복변수
6=반복변수
7=반복변수
8=반복변수
9=반복변수

0=반복변수
3=반복변수
6=반복변수
9=반복변수

* 리스트 내포 (list comprehension)

In [12]:
array = [i *i for i in range(0,20,2)]
print(array)

[0, 4, 16, 36, 64, 100, 144, 196, 256, 324]

2.4 함수(사용자 정의)

In [14]:
def print_3_times():
    print("안녕하세요")
    print("안녕하세요")
    print("안녕하세요")
    
print_3_times()

안녕하세요
안녕하세요
안녕하세요

In [15]:
def sum_all(start, end):
    output=0
    for i in range(start, end+1):
        output +=i
    return output

print("0 to 100 : ", sum_all(0,100))
print("0 to 1000 : ", sum_all(0,1000))
print("50 to 100 : ", sum_all(50,100))
print("500 to 1000 : ", sum_all(500,1000))

0 to 100 :  5050
0 to 1000 :  500500
50 to 100 :  3825
500 to 1000 :  375750

3. 파이썬 자료구조

3.1 객체

In [16]:
class Person:
    def __init__(self):
        self.hello = "안녕하세요."
    def greeting(self)    :
        print(self.hello)
james = Person()
james.greeting()

안녕하세요.

In [28]:
class Personalinfo:
    nationality = "Korean"
    def __init__(self, name, age):
        self.name = name
        self.age = age
    def getPersonalinfo(self):
        print("Name : ", self.name)
        print("Age : ", self.age)
    def ageGroup(self):
        if self.age < 30:
            return "under 30"
        else:
            return "over 30"
personal_choi = Personalinfo('CK Choi',25)        

print("personal_choi.name : ", personal_choi.name)
print("personal_choi.age : ", personal_choi.age)
print("personal_choi.ageGroup() : ", personal_choi.ageGroup())

personal_choi.name :  CK Choi
personal_choi.age :  25
personal_choi.ageGroup() :  under 30

3.2 List

* 인덱싱

In [31]:
list_a = [273,32,103,"문자열",True, False]
print(list_a[0])
print(list_a[1])
print(list_a[2])

273
32
103
[32, 103]

* 슬라이싱

In [ ]:
print(list_a[1:3])

* 리스트 길이

In [6]:
a = [1, 2, 3]
len(a)

3

* 리스트 수정

In [7]:
a = [1, 2, 3]
a[2] = 4
a

[1, 2, 4]

* 리스트 삭제

In [8]:
a = [1, 2, 3]
del a[1]
a

[1, 3]

In [14]:
a = [1, 2, 3, 4, 5]
del a[2:]
a

[1, 2]

* 리스트 추가

In [11]:
a = [1, 2, 3]
a.append(4)
a

[1, 2, 3, 4]

In [16]:
a = [1,2,3,4]
a.append([5,6])
a

[1, 2, 3, 4, [5, 6]]

In [15]:
a = [1,2,3,4]
a.extend([5,6])
a

[1, 2, 3, 4, 5, 6]

3.3 Tuple

In [33]:
tuple_test = (10,20,30)
print(tuple_test[0])
print(tuple_test[1])
print(tuple_test[2])

10
20
30

3.4 Dictionary

In [34]:
{"키A" : 10, 
 "키B" : 20, 
 "키C" : 30,
  1:     40,
 False : 50
}

{'키A': 10, '키B': 20, '키C': 30, 1: 40, False: 50}

In [38]:
dict_a ={
    "name" : "어벤저스 앤드게임",
    "type" : "히어로 무비"
}
print(dict_a)
print(dict_a["name"])
print(dict_a["type"])

{'name': '어벤저스 앤드게임', 'type': '히어로 무비'}
어벤저스 앤드게임
히어로 무비

3.5 Series

In [42]:
pd.Series(['Kim Tuna',11.1, 12, 13, 14],
         index = ['a','b','c','d','e'],
         name = 'example')

a    Kim Tuna
b        11.1
c          12
d          13
e          14
Name: example, dtype: object

In [47]:
a= pd.Series([3,-5,7,4], index = ['a','b','c','d'])
print(a)

a    3
b   -5
c    7
d    4
dtype: int64

3.6 DataFrame

In [50]:
data = {
        'Country':['Belgium', 'India', 'Brazil'],
        'Capital' :['Brussels','New Delhi', 'Brasilia'],
        'Population' : [11190846, 1303171035, 207847528]
       }
df = pd.DataFrame(data, columns = ['Country', 'Capital','Population'])
df

   Country    Capital  Population
0  Belgium   Brussels    11190846
1    India  New Delhi  1303171035
2   Brazil   Brasilia   207847528

4. 데이터분석 기본 명령어

4.1 데이터 셋

In [51]:
DF1 = DataFrame([["싸이",180,75],["덕구",160,65],["또치",170,75]], columns = ["이름","키","몸무게"])
DF1

   이름    키  몸무게
0  싸이  180   75
1  덕구  160   65
2  또치  170   75

In [6]:
DF2 = DataFrame([["싸이","포워드","잘함"],["덕구","미드필더","못함"],["똥갈","수비수","잘함"]], columns = ["이름","포지션","실력"])
DF2

   이름   포지션  실력
0  싸이   포워드  잘함
1  덕구  미드필더  못함
2  똥갈   수비수  잘함

* 데이터 병합

In [7]:
pd.merge(left = DF1 , right = DF2, how = "inner", on = "이름")

   이름    키  몸무게   포지션  실력
0  싸이  180   75   포워드  잘함
1  덕구  160   65  미드필더  못함

In [8]:
pd.merge(left = DF1 , right = DF2, how = "left", on = "이름")

   이름    키  몸무게   포지션   실력
0  싸이  180   75   포워드   잘함
1  덕구  160   65  미드필더   못함
2  또치  170   75   NaN  NaN

In [9]:
pd.merge(left = DF1 , right = DF2, how = "right", on = "이름")

   이름      키   몸무게   포지션  실력
0  싸이  180.0  75.0   포워드  잘함
1  덕구  160.0  65.0  미드필더  못함
2  똥갈    NaN   NaN   수비수  잘함

In [10]:
pd.merge(left = DF1 , right = DF2, how = "outer", on = "이름")

   이름      키   몸무게   포지션   실력
0  싸이  180.0  75.0   포워드   잘함
1  덕구  160.0  65.0  미드필더   못함
2  또치  170.0  75.0   NaN  NaN
3  똥갈    NaN   NaN   수비수   잘함

In [17]:
test = pd.merge(left = DF1 , right = DF2, how = "left", on = "이름")
test

   이름    키  몸무게   포지션   실력
0  싸이  180   75   포워드   잘함
1  덕구  160   65  미드필더   못함
2  또치  170   75   NaN  NaN

* 결측치 처리

In [30]:
test.fillna(0)

   이름    키  몸무게   포지션  실력
0  싸이  180   75   포워드  잘함
1  덕구  160   65  미드필더  못함
2  또치  170   75     0   0

In [19]:
test.dropna()

   이름    키  몸무게   포지션  실력
0  싸이  180   75   포워드  잘함
1  덕구  160   65  미드필더  못함

* 데이터 정렬

In [45]:
test.sort_values(by = ['몸무게','키'], ascending = [False, True])

   이름    키  몸무게   포지션   실력
2  또치  170   75   NaN  NaN
0  싸이  180   75   포워드   잘함
1  덕구  160   65  미드필더   못함

* 피벗테이블

In [46]:
test.pivot_table(index='몸무게', columns='실력', values='키', aggfunc='sum')

실력      못함     잘함
몸무게
65   160.0    NaN
75     NaN  180.0

4.2 행/열

* 조건에 맞는 행 선택

In [47]:
test[test['키']>=170]

   이름    키  몸무게  포지션   실력
0  싸이  180   75  포워드   잘함
2  또치  170   75  NaN  NaN

* 행 추가

In [13]:
test.loc[3] = ['신보',175,72,'공격수','보통']
test

   이름    키  몸무게   포지션   실력
0  싸이  180   75   포워드   잘함
1  덕구  160   65  미드필더   못함
2  또치  170   75   NaN  NaN
3  신보  175   72   공격수   보통

In [12]:
new_data = {'이름':'신보', '키':175, '몸무게' : 72, '포지션':'공격수', '실력':'보통'}
test.append(new_data)

TypeError: Can only append a dict if ignore_index=True

* 행 삭제

In [16]:
drop_list = test[test['이름']=='신보'].index
test = test.drop(drop_list)
test

   이름    키  몸무게   포지션   실력
0  싸이  180   75   포워드   잘함
1  덕구  160   65  미드필더   못함
2  또치  170   75   NaN  NaN

In [48]:
drop_list = test[test['키']== 170].index
test.drop(drop_list)

   이름    키  몸무게   포지션  실력
0  싸이  180   75   포워드  잘함
1  덕구  160   65  미드필더  못함

* 중복행 삭제

In [51]:
test.drop_duplicates(['몸무게'])

   이름    키  몸무게   포지션  실력
0  싸이  180   75   포워드  잘함
1  덕구  160   65  미드필더  못함

* 열 이름 변경

In [52]:
test.rename(columns={'실력':'연습'})

   이름    키  몸무게   포지션   연습
0  싸이  180   75   포워드   잘함
1  덕구  160   65  미드필더   못함
2  또치  170   75   NaN  NaN

* 열 추가

In [18]:
test['BMI'] = (test['몸무게'] / (test['키']/100)**2)
test

   이름    키  몸무게   포지션   실력        BMI
0  싸이  180   75   포워드   잘함  23.148148
1  덕구  160   65  미드필더   못함  25.390625
2  또치  170   75   NaN  NaN  25.951557

* 조건에 따른 열 추가

In [103]:
test['기준일자'] = [ '2020-12-31' if i == '잘함' else '2019-12-31' for i in test['실력']]
test

   이름    키  몸무게   포지션   실력        BMI        기준일자
0  싸이  180   75   포워드   잘함  23.148148  2020-12-31
1  덕구  160   65  미드필더   못함  25.390625  2019-12-31
2  또치  170   75   NaN  NaN  25.951557  2019-12-31

* 열 선택

In [104]:
test[['이름','기준일자']]

   이름        기준일자
0  싸이  2020-12-31
1  덕구  2019-12-31
2  또치  2019-12-31

* 열 삭제

In [105]:
test.drop(['기준일자'],axis=1)

   이름    키  몸무게   포지션   실력        BMI
0  싸이  180   75   포워드   잘함  23.148148
1  덕구  160   65  미드필더   못함  25.390625
2  또치  170   75   NaN  NaN  25.951557

* 그룹 변수(범주형 변수) 생성

In [19]:
BMI_기준값 = [
    (test['BMI'] < 20),
    (test['BMI'] >= 20) & (test['BMI'] < 24),  # 괄호 안하면 에러 발생
    (test['BMI'] >= 24)
    ]

BMI_그룹 =['저체중','정상','비만']
test['BMI_판정'] = np.select(BMI_기준값, BMI_그룹)
test

   이름    키  몸무게   포지션   실력        BMI BMI_판정
0  싸이  180   75   포워드   잘함  23.148148     정상
1  덕구  160   65  미드필더   못함  25.390625     비만
2  또치  170   75   NaN  NaN  25.951557     비만

4.3 문자열

In [106]:
from pandas.api.types import is_string_dtype
is_string_dtype(test['기준일자'])

True

* 문자열 선택

In [109]:
test['기준년도'] = test['기준일자'].str[0:4]
print(is_string_dtype(test['기준년도']))
test

True

   이름    키  몸무게   포지션   실력        BMI        기준일자     기준일자_d  기준년도
0  싸이  180   75   포워드   잘함  23.148148  2020-12-31 2020-12-31  2020
1  덕구  160   65  미드필더   못함  25.390625  2019-12-31 2019-12-31  2019
2  또치  170   75   NaN  NaN  25.951557  2019-12-31 2019-12-31  2019

* 자료형 변환 (문자열 = > 숫자형)

In [110]:
test['기준년도_n'] = pd.to_numeric(test['기준년도'])
print(is_string_dtype(test['기준년도_n']))
test

False

   이름    키  몸무게   포지션   실력        BMI        기준일자     기준일자_d  기준년도  기준년도_n
0  싸이  180   75   포워드   잘함  23.148148  2020-12-31 2020-12-31  2020    2020
1  덕구  160   65  미드필더   못함  25.390625  2019-12-31 2019-12-31  2019    2019
2  또치  170   75   NaN  NaN  25.951557  2019-12-31 2019-12-31  2019    2019

* 자료형 변환 (문자열 => 날짜형)

In [108]:
test['기준일자_d']= pd.to_datetime(test['기준일자'])
print(is_string_dtype(test['기준일자_d']))
test

False

   이름    키  몸무게   포지션   실력        BMI        기준일자     기준일자_d
0  싸이  180   75   포워드   잘함  23.148148  2020-12-31 2020-12-31
1  덕구  160   65  미드필더   못함  25.390625  2019-12-31 2019-12-31
2  또치  170   75   NaN  NaN  25.951557  2019-12-31 2019-12-31